000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "SHEET1".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-SHEET1 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--SHEET1.
000013     03 SHEET1 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  SHEET1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL1.
000013     03 LABEL1 PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  LABEL1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL2.
000013     03 LABEL2 PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  LABEL2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL3.
000013     03 LABEL3 PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  LABEL3 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL4.
000013     03 LABEL4 PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  LABEL4 USAGE POINTER.
000013   02 POWER--HPOWOBJ--SUBMIT.
000013     03 SUBMIT PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  SUBMIT USAGE POINTER.
000013   02 POWER--HPOWOBJ--FINAL-GAIN.
000013     03 FINAL-GAIN PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  FINAL-GAIN USAGE POINTER.
000013   02 POWER--HPOWOBJ--PIC1.
000013     03 PIC1 PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  PIC1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PIC2.
000013     03 PIC2 PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  PIC2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PIC3.
000013     03 PIC3 PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  PIC3 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PIC5.
000013     03 PIC5 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  PIC5 USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-SHEET1.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 11 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017 CONSTANT SECTION.
000018 LINKAGE SECTION.
000019 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000020 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000021                    USAGE IS COMPUTATIONAL-5.
000022 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000023                    USAGE IS COMPUTATIONAL-5.
000024 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000025                    USAGE IS COMPUTATIONAL-5.
000026 PROCEDURE DIVISION
000027     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000028     EVALUATE POWER--MESSAGE
000029     WHEN 1025
000030         EVALUATE POWER--HPOWOBJ
000031         WHEN POWER--HPOWOBJ--SUBMIT
000032             EVALUATE POWER--NOTIFY
000033             WHEN 1 
000034                CALL "SUBMIT-CLICK"
000035             END-EVALUATE
000036         END-EVALUATE
000037     WHEN 1024
000038         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000039     WHEN 1038
000040         CALL "SHEET1-START"
000041     END-EVALUATE
000042     EXIT PROGRAM.
000043 IDENTIFICATION DIVISION.
000044 PROGRAM-ID. "SHEET1-START".
000045 PROCEDURE DIVISION.
000046     EXIT PROGRAM.
000047 END PROGRAM "SHEET1-START".
000048 IDENTIFICATION DIVISION.
000049 PROGRAM-ID. "SUBMIT-CLICK".
000050 ENVIRONMENT DIVISION.
000051 DATA DIVISION.
000052  WORKING-STORAGE SECTION.
000053   01 WN-INVEST     PIC S9(15)V99 VALUE 0.
000054   01 WN-INTEREST   PIC S9(15)V99 VALUE 0.
000055   01 WN-PERIOD     PIC S9(15)V99 VALUE 0.
000056   01 WN-TOTAL      PIC S9(15)V99 VALUE 0.
000056 77 POW-0001 PIC S9(14)V9(4) .
000056 77 POW-0002 PIC S9(14)V9(4) .
000056 77 POW-0003 PIC S9(14)V9(4) .
000056 77 POW-0004 PIC S9(14)V9(4) .
000057 PROCEDURE   DIVISION.
000058 
000059   CALL  "XPOWPICGETNUMERIC"  USING BY VALUE PIC1  BY REFERENCE POW-0001 .
000059   MOVE POW-0001 TO WN-INVEST.
000060 
000061   CALL  "XPOWPICGETNUMERIC"  USING BY VALUE PIC2  BY REFERENCE POW-0002 .
000061   MOVE POW-0002 TO WN-INTEREST.
000062   
000063   CALL  "XPOWPICGETNUMERIC"  USING BY VALUE PIC3  BY REFERENCE POW-0003 .
000063   MOVE POW-0003 TO WN-PERIOD.
000064
000065* Calculate total interest using the formula: Interest = (Principal * Rate * Time) / 100      
000066   COMPUTE WN-TOTAL = (WN-INVEST * WN-INTEREST * WN-PERIOD) / 100.
000067      
000068   MOVE  WN-TOTAL  TO POW-0004.
000068   CALL  "XPOWPICSETNUMERIC"  USING BY VALUE PIC5  BY REFERENCE POW-0004 .
000069 END PROGRAM "SUBMIT-CLICK".
000070 END PROGRAM "SHEET1".
